rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_claim.c
// Copyright 2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <mbedtls/version.h>
/* Keep forward-compatibility with Mbed TLS 3.x */
#if (MBEDTLS_VERSION_NUMBER < 0x03000000)
#define MBEDTLS_2_X_COMPAT
#else /* !(MBEDTLS_VERSION_NUMBER < 0x03000000) */
/* Macro wrapper for struct's private members */
#ifndef MBEDTLS_ALLOW_PRIVATE_ACCESS
#define MBEDTLS_ALLOW_PRIVATE_ACCESS
#endif /* MBEDTLS_ALLOW_PRIVATE_ACCESS */
#endif /* !(MBEDTLS_VERSION_NUMBER < 0x03000000) */

#include "mbedtls/platform.h"
#include "mbedtls/pk.h"
#include "mbedtls/rsa.h"
#include "mbedtls/entropy.h"
#include "mbedtls/ctr_drbg.h"
#include "mbedtls/x509_csr.h"
#include "mbedtls/md.h"
#include "mbedtls/sha512.h"

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/event_groups.h>

#include <esp_rmaker_work_queue.h>
#include <esp_rmaker_factory.h>
#include <esp_rmaker_utils.h>

#include <esp_event.h>
#include <esp_tls.h>
#include <esp_rmaker_core.h>
#include <string.h>
#include <inttypes.h>
#include <esp_wifi.h>
#include <esp_log.h>
#include <esp_http_client.h>
#include <json_generator.h>
#include <json_parser.h>

#include "esp_rmaker_internal.h"
#include "esp_rmaker_client_data.h"
#include "esp_rmaker_claim.h"

#if RMAKER_USING_NETWORK_PROV
#include <network_provisioning/manager.h>
#else
#include <wifi_provisioning/manager.h>
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)
// Features supported in 4.4+

#ifdef CONFIG_ESP_RMAKER_USE_CERT_BUNDLE
#define ESP_RMAKER_USE_CERT_BUNDLE
#include <esp_crt_bundle.h>
#endif

#else

#ifdef CONFIG_ESP_RMAKER_USE_CERT_BUNDLE
#warning "Certificate Bundle not supported below IDF v4.4. Using provided certificate instead."
#endif

#endif /* !IDF4.4 */

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
#include "esp_mac.h"
#endif

static const char *TAG = "esp_claim";

#define ESP_RMAKER_RANDOM_NUMBER_LEN    64

#ifdef CONFIG_ESP_RMAKER_SELF_CLAIM
#include "soc/soc.h"
#include "soc/efuse_reg.h"
#include "esp_efuse.h"
#include "esp_efuse_table.h"

#define CLAIM_BASE_URL      CONFIG_ESP_RMAKER_CLAIM_SERVICE_BASE_URL
#define CLAIM_INIT_PATH     "claim/initiate"
#define CLAIM_VERIFY_PATH   "claim/verify"

extern uint8_t claim_service_server_root_ca_pem_start[] asm("_binary_rmaker_claim_service_server_crt_start");
extern uint8_t claim_service_server_root_ca_pem_end[] asm("_binary_rmaker_claim_service_server_crt_end");
#endif /* CONFIG_ESP_RMAKER_SELF_CLAIM */

#define CLAIM_PK_SIZE       2048

static EventGroupHandle_t claim_event_group;
static const int CLAIM_TASK_BIT = BIT0;
static void escape_new_line(esp_rmaker_claim_data_t *data)
{
    char *str = (char *)data->csr;
    memset(data->payload, 0, sizeof(data->payload));
    char *target_str = (char *)data->payload;
    /* Hack to just avoid a "\r\n" at the end of string */
    if (str[strlen(str) - 1] == '\n') {
        str[strlen(str) - 1] = '\0';
    }
    while (*str) {
        if (*str == '\n') {
            *target_str++ = '\\';
            *target_str++ = 'n';
            str++;
            continue;
        }
        *target_str++ = *str++;
    }
    *target_str = '\0';
    strcpy((char *)data->csr, (char *)data->payload);
    ESP_LOGD(TAG, "Modified CSR : %s", data->csr);
}

static void unescape_new_line(char *str)
{
    char *target_str = str;
    while (*str) {
        if (*str == '\\') {
            str++;
            if (*str == 'n') {
                *target_str++ = '\n';
                str++;
            }
        }
        *target_str++ = *str++;
    }
    *target_str = '\0';
}

static esp_err_t esp_rmaker_claim_generate_csr(esp_rmaker_claim_data_t *claim_data, const char *common_name)
{
    if (!claim_data || !common_name) {
        ESP_LOGE(TAG, "claim_data or common_name cannot be NULL.");
        return ESP_ERR_INVALID_ARG;
    }
    const char *pers = "gen_csr";
    mbedtls_x509write_csr csr;
    mbedtls_ctr_drbg_context ctr_drbg;
    mbedtls_entropy_context entropy;

    /* Generating CSR from the private key */
    mbedtls_x509write_csr_init(&csr);
    mbedtls_x509write_csr_set_md_alg(&csr, MBEDTLS_MD_SHA256);
    mbedtls_ctr_drbg_init(&ctr_drbg);

    ESP_LOGD(TAG, "Seeding the random number generator.");
    mbedtls_entropy_init(&entropy);
    int ret = mbedtls_ctr_drbg_seed( &ctr_drbg, mbedtls_entropy_func, &entropy, (const unsigned char *) pers, strlen(pers));
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_ctr_drbg_seed returned -0x%04x", -ret );
        goto exit;
    }
    char subject_name[50];
    snprintf(subject_name, sizeof(subject_name), "CN=%s", common_name);
    ret = mbedtls_x509write_csr_set_subject_name(&csr, subject_name);
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_x509write_csr_set_subject_name returned %d", ret );
        goto exit;
    }

    memset(claim_data->csr, 0, sizeof(claim_data->csr));
    mbedtls_x509write_csr_set_key(&csr, &claim_data->key);
    ESP_LOGD(TAG, "Generating PEM");
    ret = mbedtls_x509write_csr_pem(&csr, claim_data->csr, sizeof(claim_data->csr), mbedtls_ctr_drbg_random, &ctr_drbg);
    if (ret < 0) {
        ESP_LOGE(TAG, "mbedtls_x509write_csr_pem returned -0x%04x", -ret );
        goto exit;
    }
    ESP_LOGD(TAG, "CSR generated.");
    claim_data->state = RMAKER_CLAIM_STATE_CSR_GENERATED;
exit:

    mbedtls_x509write_csr_free(&csr);
    mbedtls_ctr_drbg_free(&ctr_drbg);
    mbedtls_entropy_free(&entropy);

    return ret;
}

static esp_err_t esp_rmaker_claim_generate_key(esp_rmaker_claim_data_t *claim_data)
{
    const char *pers = "gen_key";
    mbedtls_entropy_context entropy;
    mbedtls_ctr_drbg_context ctr_drbg;

    mbedtls_pk_free(&claim_data->key);
    mbedtls_pk_init(&claim_data->key);
    mbedtls_ctr_drbg_init(&ctr_drbg);
    memset(claim_data->payload, 0, sizeof(claim_data->payload));

    ESP_LOGD(TAG, "Seeding the random number generator.");
    mbedtls_entropy_init(&entropy);
    int ret = mbedtls_ctr_drbg_seed( &ctr_drbg, mbedtls_entropy_func, &entropy, (const unsigned char *) pers, strlen(pers));
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_ctr_drbg_seed returned -0x%04x", -ret );
        mbedtls_pk_free(&claim_data->key);
        goto exit;
    }

