rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_claim.c
    ESP_LOGW(TAG, "Generating the private key. This may take time." );
    ret = mbedtls_pk_setup(&claim_data->key, mbedtls_pk_info_from_type(MBEDTLS_PK_RSA));
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_pk_setup returned -0x%04x", -ret );
        mbedtls_pk_free(&claim_data->key);
        goto exit;
    }

    ret = mbedtls_rsa_gen_key(mbedtls_pk_rsa(claim_data->key), mbedtls_ctr_drbg_random, &ctr_drbg, CLAIM_PK_SIZE, 65537); /* here, 65537 is the RSA exponent */
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_rsa_gen_key returned -0x%04x", -ret );
        mbedtls_pk_free(&claim_data->key);
        goto exit;
    }

    claim_data->state = RMAKER_CLAIM_STATE_PK_GENERATED;
    ESP_LOGD(TAG, "Converting Private Key to PEM...");
    ret = mbedtls_pk_write_key_pem(&claim_data->key, (unsigned char *)claim_data->payload, sizeof(claim_data->payload));
    if (ret != 0) {
        ESP_LOGE(TAG, "mbedtls_pk_write_key_pem returned -0x%04x", -ret );
        mbedtls_pk_free(&claim_data->key);
    }
exit:
    mbedtls_ctr_drbg_free(&ctr_drbg);
    mbedtls_entropy_free(&entropy);
    return ret;
}

/* Parse the Claim Init response and generate Claim Verify request
 *
 * Claim Verify Response format:
 *  {"certificate":"<certificate>"}
 */
static esp_err_t handle_claim_verify_response(esp_rmaker_claim_data_t *claim_data)
{
    ESP_LOGD(TAG, "Claim Verify Response: %s", claim_data->payload);
    jparse_ctx_t jctx;
    if (json_parse_start(&jctx, claim_data->payload, strlen(claim_data->payload)) == 0) {
        int required_len = 0;
        if (json_obj_get_strlen(&jctx, "certificate", &required_len) == 0) {
            required_len++; /* For NULL termination */
            char *value_buf =  MEM_CALLOC_EXTRAM(1, required_len);
            if (!value_buf) {
                json_parse_end(&jctx);
                ESP_LOGE(TAG, "Failed to allocate %d bytes for certificate.", required_len);
                return ESP_ERR_NO_MEM;
            }
            /* Just using the certificate buffer itself (which is expected to be large enough) to
             * check if the claiming service has also sent an MQTT Host, before going on to read
             * the certificate itself.
             */
            if (json_obj_get_string(&jctx, "mqtt_host", value_buf, required_len) == 0) {
                ESP_LOGI(TAG, "Storing received MQTT Host: %s", value_buf);
                esp_rmaker_factory_set(ESP_RMAKER_MQTT_HOST_NVS_KEY, value_buf, strlen(value_buf));
                memset(value_buf, 0, required_len);
            }
            json_obj_get_string(&jctx, "certificate", value_buf, required_len);
            json_parse_end(&jctx);
            unescape_new_line(value_buf);
            esp_err_t err = esp_rmaker_factory_set(ESP_RMAKER_CLIENT_CERT_NVS_KEY, value_buf, strlen(value_buf));
            free(value_buf);
            return err;
        } else {
            ESP_LOGE(TAG, "Claim Verify Response invalid.");
        }
    }
    ESP_LOGE(TAG, "Failed to parse Claim Verify Response.");
    return ESP_FAIL;
}

static esp_err_t generate_claim_init_request(esp_rmaker_claim_data_t *claim_data)
{
    if (claim_data->state < RMAKER_CLAIM_STATE_PK_GENERATED) {
        return ESP_ERR_INVALID_STATE;
    }
    uint8_t mac_addr[6];
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
    /* ESP_MAC_BASE was introduced in ESP-IDF v5.1. It is the same as the Wi-Fi Station MAC address
     * for chips supporting Wi-Fi. We can use base MAC address to generate claim init request for both
     * Wi-Fi and Thread devices
     */
    esp_err_t err = esp_read_mac(mac_addr, ESP_MAC_BASE);
#else
    /* Thread was officially supported in ESP-IDF v5.1. Use Wi-Fi Station MAC address to generate claim
     * init request.
     */
    esp_err_t err = esp_wifi_get_mac(WIFI_IF_STA, mac_addr);
#endif
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Could not fetch MAC address.");
        return err;
    }

    snprintf(claim_data->payload, sizeof(claim_data->payload),
            "{\"mac_addr\":\"%02X%02X%02X%02X%02X%02X\",\"platform\":\"%s\"}",
            mac_addr[0], mac_addr[1], mac_addr[2], mac_addr[3], mac_addr[4], mac_addr[5], CONFIG_IDF_TARGET);
    claim_data->payload_len = strlen(claim_data->payload);
    claim_data->payload_offset = 0;
    return ESP_OK;
}

void esp_rmaker_claim_data_free(esp_rmaker_claim_data_t *claim_data)
{
    if(claim_data) {
        mbedtls_pk_free(&claim_data->key);
        free(claim_data);
    }
}

#ifdef CONFIG_ESP_RMAKER_SELF_CLAIM

static esp_err_t read_hmac_key(uint32_t *out_hmac_key, size_t hmac_key_size)
{
    /* ESP32-S2 HMAC Key programming scheme */
    if (hmac_key_size != 16) {
        ESP_LOGE(TAG, "HMAC key size should be 16 bytes.");
    }
    esp_err_t err = esp_efuse_read_field_blob(ESP_EFUSE_OPTIONAL_UNIQUE_ID, out_hmac_key, hmac_key_size * 8);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_efuse_read_field_blob failed!");
    }
    return err;
}

static esp_err_t hmac_challenge(const char* hmac_request, unsigned char *hmac_response, size_t len_hmac_response)
{
    mbedtls_md_context_t ctx;
    mbedtls_md_type_t md_type = MBEDTLS_MD_SHA512;
    uint32_t hmac_key[4];

    esp_err_t err = read_hmac_key(hmac_key, sizeof(hmac_key));
    if (err != ESP_OK) {
        return err;
    }

    mbedtls_md_init(&ctx);
    int ret = mbedtls_md_setup(&ctx, mbedtls_md_info_from_type(md_type) ,1);
    ret |= mbedtls_md_hmac_starts(&ctx, (const unsigned char *)hmac_key, sizeof(hmac_key));
    ret |= mbedtls_md_hmac_update(&ctx, (const unsigned char *)hmac_request, strlen(hmac_request));
    ret |= mbedtls_md_hmac_finish(&ctx, hmac_response);
    mbedtls_md_free(&ctx);

    if(ret == 0) {
        return ESP_OK;
    } else {
        return ret;
    }
}

/* Parse the Claim Init response and generate Claim Verify request
 *
 * Claim Init Response format:
 *  {"auth_id":"<unique-auth-id>", "challenge":"<upto 128 byte challenge>"}
 *
 * Claim Verify Request format
 *  {"auth_id":"<claim-id-from-init>", "challenge_response":"<64byte-response-in-hex>, "csr":"<csr-generated-earlier>"}
 */
static esp_err_t handle_self_claim_init_response(esp_rmaker_claim_data_t *claim_data)
{
    ESP_LOGD(TAG, "Claim Init Response: %s", claim_data->payload);
    jparse_ctx_t jctx;
    if (json_parse_start(&jctx, claim_data->payload, strlen(claim_data->payload)) == 0) {
        char auth_id[64];
        char challenge[130];
        int ret = json_obj_get_string(&jctx, "auth_id", auth_id, sizeof(auth_id));
        ret |= json_obj_get_string(&jctx, "challenge", challenge, sizeof(challenge));
        json_parse_end(&jctx);
        if (ret == 0) {
            unsigned char response[64] = {0};
            if (hmac_challenge(challenge, response, sizeof(response)) == ESP_OK) {
                json_gen_str_t jstr;
                json_gen_str_start(&jstr, claim_data->payload, sizeof(claim_data->payload), NULL, NULL);
                json_gen_start_object(&jstr);
                json_gen_obj_set_string(&jstr, "auth_id", auth_id);
                /* Add Challenge Response as a hex representation */
                json_gen_obj_start_long_string(&jstr, "challenge_response", NULL);
                for(int i = 0 ; i < sizeof(response); i++) {
                    char hexstr[3];
                    snprintf(hexstr, sizeof(hexstr), "%02X", response[i]);
                    json_gen_add_to_long_string(&jstr, hexstr);
                }
                json_gen_end_long_string(&jstr);
                json_gen_obj_set_string(&jstr, "csr", (char *)claim_data->csr);
                json_gen_end_object(&jstr);
                json_gen_str_end(&jstr);
                return ESP_OK;
            } else {
                ESP_LOGE(TAG, "HMAC Challenge failed.");
            }
        } else {
            ESP_LOGE(TAG, "Claim Init Response invalid.");
        }
    }
    ESP_LOGE(TAG, "Failed to parse Claim Init Response.");
    return ESP_FAIL;
}
static esp_err_t esp_rmaker_claim_perform_common(esp_rmaker_claim_data_t *claim_data, const char *path)
{
    char url[100];
    snprintf(url, sizeof(url), "%s/%s", CLAIM_BASE_URL, path);
    esp_http_client_config_t config = {
        .url = url,
        .transport_type = HTTP_TRANSPORT_OVER_SSL,
        .buffer_size = 1024,
#ifdef ESP_RMAKER_USE_CERT_BUNDLE
        .crt_bundle_attach = esp_crt_bundle_attach,
#else
        .cert_pem = (const char *)claim_service_server_root_ca_pem_start,
#endif
        .skip_cert_common_name_check = false
    };
    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (!client) {
        ESP_LOGE(TAG, "Failed to initialise HTTP Client.");
        return ESP_FAIL;
    }

    ESP_LOGD(TAG, "Payload for %s: %s", url, claim_data->payload);
    esp_http_client_set_method(client, HTTP_METHOD_POST);
    esp_err_t err = esp_http_client_open(client, strlen(claim_data->payload));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to open connection to %s", url);
        esp_http_client_cleanup(client);
        return ESP_FAIL;
    }
    int len = esp_http_client_write(client, claim_data->payload, strlen(claim_data->payload));
    if (len != strlen(claim_data->payload)) {
        ESP_LOGE(TAG, "Failed to write Payload. Returned len = %d.", len);
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        return ESP_FAIL;
    }
    ESP_LOGD(TAG, "Wrote %d of %d bytes.", len, strlen(claim_data->payload));
    len = esp_http_client_fetch_headers(client);
    int status = esp_http_client_get_status_code(client);
    if ((len > 0) && (status == 200)) {
        len = esp_http_client_read_response(client, claim_data->payload, sizeof(claim_data->payload));
        claim_data->payload[len] = '\0';
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        return ESP_OK;
    } else {
        len = esp_http_client_read_response(client, claim_data->payload, sizeof(claim_data->payload));
        if (len >= 0) {
            claim_data->payload[len] = 0;
        }
        ESP_LOGE(TAG, "Invalid response for %s", url);
        ESP_LOGE(TAG, "Status = %d, Data = %s", status, len > 0 ? claim_data->payload : "None");
    }
    esp_http_client_close(client);
    esp_http_client_cleanup(client);
    return ESP_FAIL;
}
static esp_err_t esp_rmaker_claim_perform_init(esp_rmaker_claim_data_t *claim_data)
{
    esp_err_t err = generate_claim_init_request(claim_data);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to generate Claim init request");
        return err;
    }

    err = esp_rmaker_claim_perform_common(claim_data, CLAIM_INIT_PATH);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Claim Init Request Failed.");
        return err;
    }
    claim_data->state = RMAKER_CLAIM_STATE_INIT;
    err = handle_self_claim_init_response(claim_data);
    if (err == ESP_OK) {
        claim_data->state = RMAKER_CLAIM_STATE_INIT_DONE;
    }
    return err;
}

static esp_err_t esp_rmaker_claim_perform_verify(esp_rmaker_claim_data_t *claim_data)
{
    esp_err_t err = esp_rmaker_claim_perform_common(claim_data, CLAIM_VERIFY_PATH);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Claim Verify Failed.");
        return err;
    }
    claim_data->state = RMAKER_CLAIM_STATE_VERIFY;
    err = handle_claim_verify_response(claim_data);
    if (err == ESP_OK) {
        claim_data->state = RMAKER_CLAIM_STATE_VERIFY_DONE;
    }
    return err;
}

