rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_claim.c
esp_err_t esp_rmaker_self_claim_perform(esp_rmaker_claim_data_t *claim_data)
{
    ESP_LOGI(TAG, "Starting the Self Claim Process. This may take time.");
    if (claim_data == NULL) {
        ESP_LOGE(TAG, "Self claiming not initialised.");
        return ESP_ERR_INVALID_STATE;
    }
    esp_err_t err = esp_rmaker_claim_perform_init(claim_data);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Claim Init Sequence Failed.");
        return err;
    }
    err = esp_rmaker_claim_perform_verify(claim_data);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "Self Claiming was successful. Certificate received.");
    }
    esp_rmaker_claim_data_free(claim_data);
    return err;
}
#endif /* CONFIG_ESP_RMAKER_SELF_CLAIM */
#ifdef CONFIG_ESP_RMAKER_ASSISTED_CLAIM
static EventGroupHandle_t claim_csr_event_group;
static const int CLAIM_CSR_TASK_BIT = BIT1;
static void esp_rmaker_claim_csr_task(void *args)
{
    esp_rmaker_claim_data_t *claim_data = (esp_rmaker_claim_data_t *)args;
    esp_rmaker_claim_generate_csr(claim_data, esp_rmaker_get_node_id());
    xEventGroupSetBits(claim_csr_event_group, CLAIM_CSR_TASK_BIT);
    vTaskDelete(NULL);
}
static esp_err_t _esp_rmaker_claim_generate_csr(esp_rmaker_claim_data_t *claim_data)
{
    claim_csr_event_group = xEventGroupCreate();
    if (!claim_csr_event_group) {
        ESP_LOGE(TAG, "Couldn't create CSR event group.");
        return ESP_ERR_NO_MEM;
    }

#define ESP_RMAKER_CLAIM_CSR_TASK_STACK_SIZE (10 * 1024)
    if (xTaskCreate(&esp_rmaker_claim_csr_task, "claim_csr_task", ESP_RMAKER_CLAIM_CSR_TASK_STACK_SIZE,
                    claim_data, (CONFIG_ESP_RMAKER_WORK_QUEUE_TASK_PRIORITY + 1), NULL) != pdPASS) {
        ESP_LOGE(TAG, "Couldn't create CSR generation task");
        vEventGroupDelete(claim_csr_event_group);
        return ESP_ERR_NO_MEM;
    }

    /* Wait for claim init to complete */
    xEventGroupWaitBits(claim_csr_event_group, CLAIM_CSR_TASK_BIT, false, true, portMAX_DELAY);
    if (claim_data->state == RMAKER_CLAIM_STATE_CSR_GENERATED) {
        return ESP_OK;
    }
    return ESP_FAIL;
}
/* Parse the Claim Init response and generate Claim Verify request
 *
 * Claim Init Response format:
 *  {"node_id":"<unique-node-id>"}
 *
 * Claim Verify Request format
 *  {"csr":"<csr-generated>"}
 */
static esp_err_t handle_assisted_claim_init_response(esp_rmaker_claim_data_t *claim_data)
{
    ESP_LOGD(TAG, "Claim Init Response: %s", claim_data->payload);
    jparse_ctx_t jctx;
    if (json_parse_start(&jctx, claim_data->payload, strlen(claim_data->payload)) == 0) {
        char node_id[64];
        int ret = json_obj_get_string(&jctx, "node_id", node_id, sizeof(node_id));
        json_parse_end(&jctx);
        if (ret == 0) {
            esp_rmaker_factory_set("node_id", node_id, strlen(node_id));
            esp_rmaker_change_node_id(node_id, strlen(node_id));
            /* We use _esp_rmaker_claim_generate_csr instead of esp_rmaker_claim_generate_csr()
             * because the thread in whose context this function is called doesn't have
             * enough stack memory to generate CSR. A new thread with larger stack is spawned
             * to generate the CSR by the below function.
             */
            esp_err_t err = _esp_rmaker_claim_generate_csr(claim_data);
            if (err != ESP_OK) {
                ESP_LOGE(TAG, "Failed to generate CSR.");
                return err;
            }
            escape_new_line(claim_data);

            json_gen_str_t jstr;
            json_gen_str_start(&jstr, claim_data->payload, sizeof(claim_data->payload), NULL, NULL);
            json_gen_start_object(&jstr);
            json_gen_obj_set_string(&jstr, "csr", (char *)claim_data->csr);
            json_gen_obj_set_bool(&jstr, "send_mqtt_host", true);
            json_gen_end_object(&jstr);
            json_gen_str_end(&jstr);
            claim_data->payload_len = strlen(claim_data->payload);
            claim_data->payload_offset = 0;
            return ESP_OK;
        } else {
            ESP_LOGE(TAG, "Claim Init Response invalid.");
        }
    }
    ESP_LOGE(TAG, "Failed to parse Claim Init Response.");
    return ESP_FAIL;
}
#include <esp_rmaker_claim.pb-c.h>
#define CLAIM_FRAGMENT_SIZE 200
esp_err_t esp_rmaker_assisted_claim_handle_start(RmakerClaim__RMakerClaimPayload *command,
            RmakerClaim__RMakerClaimPayload *response, esp_rmaker_claim_data_t *claim_data)
{
    if (claim_data->state < RMAKER_CLAIM_STATE_PK_GENERATED) {
        ESP_LOGE(TAG, "PK not created. Cannot proceed with Assisted Claiming.");
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidState;
        return ESP_OK;
    }
    if (generate_claim_init_request(claim_data) != ESP_OK) {
        return ESP_OK;
    }
    RmakerClaim__PayloadBuf *payload_buf = response->resppayload->buf;
    payload_buf->offset = 0;
    payload_buf->totallen = claim_data->payload_len;
    payload_buf->payload.data = (uint8_t *)claim_data->payload;
    payload_buf->payload.len = claim_data->payload_len;
    response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__Success;
    claim_data->state = RMAKER_CLAIM_STATE_INIT;
    ESP_LOGI(TAG, "Assisted Claiming Started.");
    return ESP_OK;
}

/* Return ESP_OK if this is just an application layer error. The response content will
 * indicate error to the client.
 */
ProtobufCBinaryData *esp_rmaker_assisted_claim_validate_data(RmakerClaim__PayloadBuf *recv_payload,
        RmakerClaim__RMakerClaimPayload *response, esp_rmaker_claim_data_t *claim_data)
{
    if (recv_payload == NULL) {
        ESP_LOGE(TAG, "Empty response received. Cannot proceed.");
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
        return NULL;
    }
    /* Read the command */
    ProtobufCBinaryData *recv_payload_buf = &recv_payload->payload;
    if (!recv_payload_buf) {
        ESP_LOGE(TAG, "No data received. Cannot proceed.");
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
        return NULL;
    }
    if ((recv_payload_buf->len + recv_payload->offset) > recv_payload->totallen) {
        ESP_LOGE(TAG, "Received data exceeds total length.");
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
        return NULL;
    }
    if (recv_payload_buf->len >= sizeof(claim_data->payload)) {
        ESP_LOGE(TAG, "Received data too long (%d bytes).", recv_payload_buf->len);
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__NoMemory;
        return NULL;
    }
    return recv_payload_buf;
}

/* Return ESP_OK if this is just an application layer error. The response content will
 * indicate error to the client.
 */
esp_err_t esp_rmaker_assisted_claim_handle_init(RmakerClaim__RMakerClaimPayload *command,
            RmakerClaim__RMakerClaimPayload *response, esp_rmaker_claim_data_t *claim_data)
{
    if (claim_data->state < RMAKER_CLAIM_STATE_INIT) {
        ESP_LOGE(TAG, "Claiming hasn't started. Cannot proceed with init handling.");
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidState;
        return ESP_OK;
    } else if (claim_data->state != RMAKER_CLAIM_STATE_INIT_DONE) {
        if (command->payload_case != RMAKER_CLAIM__RMAKER_CLAIM_PAYLOAD__PAYLOAD_CMD_PAYLOAD) {
             ESP_LOGE(TAG, "Invalid response received for Claim Init. Cannot proceed.");
             response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
             return ESP_OK;
        }
        RmakerClaim__PayloadBuf *recv_payload = command->cmdpayload;
        ProtobufCBinaryData *recv_payload_buf = esp_rmaker_assisted_claim_validate_data
                                                    (recv_payload, response, claim_data);
        if (!recv_payload_buf) {
            ESP_LOGE(TAG, "Failed to get Claim Init Data.");
            return ESP_OK;
        }
        if (recv_payload_buf->len != recv_payload->totallen) {
            ESP_LOGE(TAG, "Claim Init Data length not equal to total length. Cannot proceed.");
            response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
            return ESP_OK;
        }
        memset(claim_data->payload, 0, sizeof(claim_data->payload));
        memcpy(claim_data->payload, recv_payload_buf->data, recv_payload_buf->len);
        if (handle_assisted_claim_init_response(claim_data) != ESP_OK) {
            response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
            ESP_LOGE(TAG, "Error handling Claim Init response.");
            return ESP_OK;
        } else {
            claim_data->state = RMAKER_CLAIM_STATE_INIT_DONE;
        }
    }
    RmakerClaim__PayloadBuf *payload_buf = response->resppayload->buf;
    payload_buf->totallen = claim_data->payload_len;
    payload_buf->offset = claim_data->payload_offset;

    payload_buf->payload.data = (uint8_t *)claim_data->payload + claim_data->payload_offset;
    payload_buf->payload.len = (claim_data->payload_len - claim_data->payload_offset) > CLAIM_FRAGMENT_SIZE ?
            CLAIM_FRAGMENT_SIZE : (claim_data->payload_len - claim_data->payload_offset);

