rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_claim.c
    claim_data->payload_offset += payload_buf->payload.len;

    response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__Success;

    if (claim_data->payload_offset == claim_data->payload_len) {
        ESP_LOGD(TAG, "Finished sending Claim Verify Payload.");
        claim_data->state = RMAKER_CLAIM_STATE_VERIFY;
    }
    return ESP_OK;
}
/* Return ESP_OK if this is just an application layer error. The response content will
 * indicate error to the client.
 */
esp_err_t esp_rmaker_assisted_claim_handle_verify(RmakerClaim__RMakerClaimPayload *command,
            RmakerClaim__RMakerClaimPayload *response, esp_rmaker_claim_data_t *claim_data)
{
    if (claim_data->state < RMAKER_CLAIM_STATE_VERIFY) {
        ESP_LOGE(TAG, "Invalid state. Cannot proceed with verify handling.");
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidState;
        return ESP_OK;
    }
    if (command->payload_case != RMAKER_CLAIM__RMAKER_CLAIM_PAYLOAD__PAYLOAD_CMD_PAYLOAD) {
        ESP_LOGE(TAG, "Invalid response received for Claim Verify. Cannot proceed.");
        response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
        return ESP_OK;
    }
    RmakerClaim__PayloadBuf *recv_payload = command->cmdpayload;
    ProtobufCBinaryData *recv_payload_buf = esp_rmaker_assisted_claim_validate_data
                                                (recv_payload, response, claim_data);
    if (!recv_payload_buf) {
        ESP_LOGE(TAG, "Failed to get Claim Verify Data.");
        return ESP_OK;
    }
    /* If offset is 0, this is the start of the fragmented data. */
    if (recv_payload->offset == 0) {
        memset(claim_data->payload, 0, sizeof(claim_data->payload));
        claim_data->payload_offset = 0;
        claim_data->payload_len = 0;
    }
    claim_data->payload_offset = recv_payload->offset;
    memcpy(claim_data->payload + claim_data->payload_offset, recv_payload_buf->data, recv_payload_buf->len);
    claim_data->payload_len += recv_payload_buf->len;

    if ((recv_payload->offset + recv_payload_buf->len) == recv_payload->totallen) {
        ESP_LOGD(TAG, "Received complete response of len = %"PRIu32" bytes for Claim Verify", recv_payload->totallen);
        if (handle_claim_verify_response(claim_data) == ESP_OK) {
            ESP_LOGI(TAG,"Assisted Claiming was Successful.");
            claim_data->state = RMAKER_CLAIM_STATE_VERIFY_DONE;
            if (claim_event_group) {
                xEventGroupSetBits(claim_event_group, CLAIM_TASK_BIT);
            }
        } else {
            response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__InvalidParam;
            return ESP_OK;
        }
    }
    response->resppayload->status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__Success;
    return ESP_OK;
}

esp_err_t esp_rmaker_claiming_handler(uint32_t session_id, const uint8_t *inbuf, ssize_t inlen, uint8_t **outbuf, ssize_t *outlen, void *priv_data)
{
    esp_rmaker_claim_data_t *claim_data = (esp_rmaker_claim_data_t *)priv_data;
    if (!priv_data) {
        ESP_LOGE(TAG, "Claim data cannot be NULL. Cannot proceed with Assisted Claiming.");
        return ESP_ERR_INVALID_STATE;
    }
    RmakerClaim__RMakerClaimPayload *command;
    command = rmaker_claim__rmaker_claim_payload__unpack(NULL, inlen, inbuf);

    if (!command) {
        ESP_LOGE(TAG, "No Claim command received");
        return ESP_ERR_INVALID_ARG;
    }

    /* Initialise the response objects */
    RmakerClaim__RMakerClaimPayload response;
    rmaker_claim__rmaker_claim_payload__init(&response);
    response.msg = command->msg + 1;
    response.payload_case = RMAKER_CLAIM__RMAKER_CLAIM_PAYLOAD__PAYLOAD_RESP_PAYLOAD;

    RmakerClaim__RespPayload resppayload;
    rmaker_claim__resp_payload__init(&resppayload);
    resppayload.status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__Fail;
    response.resppayload = &resppayload;

    RmakerClaim__PayloadBuf payload_buf;
    rmaker_claim__payload_buf__init(&payload_buf);
    resppayload.buf = &payload_buf;

    ESP_LOGD(TAG, "Received claim command: %d", command->msg);

    /* Handle the received command */
    switch (command->msg) {
        case RMAKER_CLAIM__RMAKER_CLAIM_MSG_TYPE__TypeCmdClaimStart:
            esp_rmaker_assisted_claim_handle_start(command, &response, claim_data);
            break;
        case RMAKER_CLAIM__RMAKER_CLAIM_MSG_TYPE__TypeCmdClaimInit:
            esp_rmaker_assisted_claim_handle_init(command, &response, claim_data);
            break;
        case RMAKER_CLAIM__RMAKER_CLAIM_MSG_TYPE__TypeCmdClaimVerify:
            esp_rmaker_assisted_claim_handle_verify(command, &response, claim_data);
            break;
        case RMAKER_CLAIM__RMAKER_CLAIM_MSG_TYPE__TypeCmdClaimAbort:
            memset(claim_data->payload, 0, sizeof(claim_data->payload));
            claim_data->payload_len = 0;
            claim_data->payload_offset = 0;
            /* Go back to RMAKER_CLAIM_STATE_PK_GENERATED, so that claim can restart */
            claim_data->state = RMAKER_CLAIM_STATE_PK_GENERATED;
            resppayload.status = RMAKER_CLAIM__RMAKER_CLAIM_STATUS__Success;
            ESP_LOGW(TAG, "Assisted Claiming Aborted.");
            break;
        default:
            break;
    }
    *outlen = rmaker_claim__rmaker_claim_payload__get_packed_size(&response);
    *outbuf = (uint8_t *)MEM_ALLOC_EXTRAM(*outlen);
    rmaker_claim__rmaker_claim_payload__pack(&response, *outbuf);
    rmaker_claim__rmaker_claim_payload__free_unpacked(command, NULL);
    return ESP_OK;
}
#define CLAIM_ENDPOINT      "rmaker_claim"
static void event_handler(void* arg, esp_event_base_t event_base,
                          int32_t event_id, void* event_data)
{
#if RMAKER_USING_NETWORK_PROV
    if (event_base == NETWORK_PROV_EVENT) {
        switch (event_id) {
            case NETWORK_PROV_INIT: {
                static const char *capabilities[] = {"claim"};
                network_prov_mgr_set_app_info("rmaker", "1.0", capabilities, 1);
                if (network_prov_mgr_endpoint_create(CLAIM_ENDPOINT) != ESP_OK) {
                    ESP_LOGE(TAG, "Failed to create claim end point.");
                }
                break;
            }
            case NETWORK_PROV_START:
                if (network_prov_mgr_endpoint_register(CLAIM_ENDPOINT, esp_rmaker_claiming_handler, arg) != ESP_OK) {
                    ESP_LOGE(TAG, "Failed to register claim end point.");
                }
                break;
            default:
                break;
        }
    }
#else
    if (event_base == WIFI_PROV_EVENT) {
        switch (event_id) {
            case WIFI_PROV_INIT: {
                static const char *capabilities[] = {"claim"};
                wifi_prov_mgr_set_app_info("rmaker", "1.0", capabilities, 1);
                if (wifi_prov_mgr_endpoint_create(CLAIM_ENDPOINT) != ESP_OK) {
                    ESP_LOGE(TAG, "Failed to create claim end point.");
                }
                break;
            }
            case WIFI_PROV_START:
                if (wifi_prov_mgr_endpoint_register(CLAIM_ENDPOINT, esp_rmaker_claiming_handler, arg) != ESP_OK) {
                    ESP_LOGE(TAG, "Failed to register claim end point.");
                }
                break;
            default:
                break;
        }
    }
#endif /* RMAKER_USING_NETWORK_PROV */
}
#endif /* CONFIG_ESP_RMAKER_ASSISTED_CLAIM */
esp_err_t __esp_rmaker_claim_init(esp_rmaker_claim_data_t *claim_data)
{
    esp_err_t err = ESP_OK;

