rednblkx/HomeKey-ESP32/managed_components/espressif__esp_rainmaker/src/core/esp_rmaker_claim.c
    char *key = esp_rmaker_get_client_key();
    if (key) {
        mbedtls_pk_free(&claim_data->key);
        mbedtls_pk_init(&claim_data->key);
#ifdef MBEDTLS_2_X_COMPAT
        int ret = mbedtls_pk_parse_key(&claim_data->key, (uint8_t *)key, strlen(key) + 1, NULL, 0);
#else
        int ret = mbedtls_pk_parse_key(&claim_data->key, (uint8_t *)key, strlen(key) + 1, NULL, 0, mbedtls_ctr_drbg_random, NULL);
#endif
        if (ret == 0) {
            ESP_LOGI(TAG, "Private key already exists. No need to re-initialise it.");
            claim_data->state = RMAKER_CLAIM_STATE_PK_GENERATED;
        }
        free(key);
    }
    if (claim_data->state != RMAKER_CLAIM_STATE_PK_GENERATED) {
        /* Generate the Private Key */
        err = esp_rmaker_claim_generate_key(claim_data);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Failed to generate private key.");
            return err;
        }
        err = esp_rmaker_factory_set(ESP_RMAKER_CLIENT_KEY_NVS_KEY, claim_data->payload, strlen((char *)claim_data->payload));
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Failed to save private key to storage.");
            return err;
        }
    }
    /* Check if the general purpose random bytes are already present in the storage */
    char *stored_random_bytes = esp_rmaker_factory_get(ESP_RMAKER_CLIENT_RANDOM_NVS_KEY);
    if (stored_random_bytes == NULL) {
        /* Generate random bytes for general purpose use */
        uint8_t random_bytes[ESP_RMAKER_RANDOM_NUMBER_LEN];
        esp_fill_random(&random_bytes, sizeof(random_bytes));

        /* Store the random bytes in the factory storage */
        err = esp_rmaker_factory_set(ESP_RMAKER_CLIENT_RANDOM_NVS_KEY, random_bytes, sizeof(random_bytes));
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "Failed to store random bytes to storage.");
            return err;
        }
    } else {
        /* Free the copy of the random bytes as it isn't required here. */
        free(stored_random_bytes);
    }
#ifdef CONFIG_ESP_RMAKER_SELF_CLAIM
    err = esp_rmaker_claim_generate_csr(claim_data, esp_rmaker_get_node_id());
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to generate CSR.");
        return err;
    }
     /* New line characters from the CSR need to be removed and replaced with explicit \n for the claiming
     * service to parse properly. Make that change here and store the CSR in storage.
     */
    escape_new_line(claim_data);
#endif /* CONFIG_ESP_RMAKER_SELF_CLAIM */
    return err;
}

void esp_rmaker_claim_task(void *args)
{
    if (!args) {
        ESP_LOGE(TAG, "Arguments for claiming task cannot be NULL");
        return;
    }
    esp_rmaker_claim_data_t *claim_data = MEM_CALLOC_EXTRAM(1, sizeof(esp_rmaker_claim_data_t));
    if (!claim_data) {
        ESP_LOGE(TAG, "Failed to allocate memory for claim data.");
        return;
    }
    if (__esp_rmaker_claim_init(claim_data) != ESP_OK) {
        esp_rmaker_claim_data_free(claim_data);
    } else {
        *((esp_rmaker_claim_data_t **)args) = claim_data;
    }
    xEventGroupSetBits(claim_event_group, CLAIM_TASK_BIT);
    vTaskDelete(NULL);
}

static esp_rmaker_claim_data_t *esp_rmaker_claim_init(void)
{
    static bool claim_init_done;
    if (claim_init_done) {
        ESP_LOGE(TAG, "Claim already initialised");
        return NULL;
    }
    claim_event_group = xEventGroupCreate();
    if (!claim_event_group) {
        ESP_LOGE(TAG, "Couldn't create event group");
        return NULL;
    }
    esp_rmaker_claim_data_t *claim_data = NULL;

#define ESP_RMAKER_CLAIM_TASK_STACK_SIZE (10 * 1024)
    /* Using tskIDLE_PRIORITY so that the time consuming tasks, especially
     * PK generation does not trigger task WatchDog timer.
     */
    if (xTaskCreate(&esp_rmaker_claim_task, "claim_task", ESP_RMAKER_CLAIM_TASK_STACK_SIZE,
                &claim_data, tskIDLE_PRIORITY, NULL) != pdPASS) {
        ESP_LOGE(TAG, "Couldn't create Claim task");
        vEventGroupDelete(claim_event_group);
        return NULL;
    }

    /* Wait for claim init to complete */
    xEventGroupWaitBits(claim_event_group, CLAIM_TASK_BIT, false, true, portMAX_DELAY);
    vEventGroupDelete(claim_event_group);
    claim_event_group = NULL;
    return claim_data;
}

#ifdef CONFIG_ESP_RMAKER_SELF_CLAIM
esp_rmaker_claim_data_t *esp_rmaker_self_claim_init(void)
{
    ESP_LOGI(TAG, "Initialising Self Claiming. This may take time.");
    return esp_rmaker_claim_init();
}
#endif
#ifdef CONFIG_ESP_RMAKER_ASSISTED_CLAIM
esp_err_t esp_rmaker_assisted_claim_perform(esp_rmaker_claim_data_t *claim_data)
{
    if (claim_data == NULL) {
        ESP_LOGE(TAG, "Assisted claiming not initialised.");
        return ESP_ERR_INVALID_STATE;
    }
    claim_event_group = xEventGroupCreate();
    if (!claim_event_group) {
        ESP_LOGE(TAG, "Couldn't create event group");
        return ESP_ERR_NO_MEM;
    }
    /* Wait for assisted claim to complete */
    ESP_LOGI(TAG, "Waiting for assisted claim to finish.");
    xEventGroupWaitBits(claim_event_group, CLAIM_TASK_BIT, false, true, portMAX_DELAY);
    esp_err_t err = ESP_FAIL;
    if (claim_data->state == RMAKER_CLAIM_STATE_VERIFY_DONE) {
        err = ESP_OK;
    }
#if RMAKER_USING_NETWORK_PROV
    esp_event_handler_unregister(NETWORK_PROV_EVENT, NETWORK_PROV_INIT, &event_handler);
    esp_event_handler_unregister(NETWORK_PROV_EVENT, NETWORK_PROV_START, &event_handler);
#else
    esp_event_handler_unregister(WIFI_PROV_EVENT, WIFI_PROV_INIT, &event_handler);
    esp_event_handler_unregister(WIFI_PROV_EVENT, WIFI_PROV_START, &event_handler);
#endif
    esp_rmaker_claim_data_free(claim_data);
    vEventGroupDelete(claim_event_group);
    return err;
}
esp_rmaker_claim_data_t *esp_rmaker_assisted_claim_init(void)
{
    ESP_LOGI(TAG, "Initialising Assisted Claiming. This may take time.");
    esp_rmaker_claim_data_t *claim_data = esp_rmaker_claim_init();
    if (claim_data) {
#if RMAKER_USING_NETWORK_PROV
        esp_event_handler_register(NETWORK_PROV_EVENT, NETWORK_PROV_INIT, &event_handler, claim_data);
        esp_event_handler_register(NETWORK_PROV_EVENT, NETWORK_PROV_START, &event_handler, claim_data);
#else
        esp_event_handler_register(WIFI_PROV_EVENT, WIFI_PROV_INIT, &event_handler, claim_data);
        esp_event_handler_register(WIFI_PROV_EVENT, WIFI_PROV_START, &event_handler, claim_data);
#endif
    }
    return claim_data;
}
#endif
